# Milestone 2
Annie Anand
Jacob Stambaugh

In [11]:
%%bigquery
SELECT * from covid_19_staging.Spring_Cases;

,fips,admin2,state,country,last_update,latitude,longitude,confirmed,deaths,recovered,active,combined_key
0,NaN,None,None,MS Zaandam,2020-04-12 23:17:00,None,None,9,2,0,7,MS Zaandam
1,NaN,None,None,MS Zaandam,2020-04-13 23:07:34,None,None,9,2,0,7,MS Zaandam
2,NaN,None,None,MS Zaandam,2020-04-14 23:33:12,None,None,9,2,0,7,MS Zaandam
3,NaN,None,None,MS Zaandam,2020-04-15 22:56:32,None,None,9,2,0,7,MS Zaandam
4,NaN,None,None,MS Zaandam,2020-04-16 23:30:31,None,None,9,2,0,7,MS Zaandam
...,...,...,...,...,...,...,...,...,...,...,...,...
182099,NaN,None,Falkland Islands (Islas Malvinas),United Kingdom,2020-04-05 23:06:26,-51.7963,-59.5236,2,0,0,2,"Falkland Islands (Islas Malvinas), United Kingdom"
182100,NaN,None,Falkland Islands (Islas Malvinas),United Kingdom,4/6/20 23:21,-51.7963,-59.5236,2,0,0,2,"Falkland Islands (Islas Malvinas), United Kingdom"
182101,NaN,None,Falkland Islands (Islas Malvinas),United Kingdom,4/4/20 23:34,-51.7963,-59.5236,1,0,0,1,"Falkland Islands (Islas Malvinas), United Kingdom"
182102,NaN,None,Falkland Islands (Islas Malvinas),United Kingdom,2020-04-05 23:06:26,-51.7963,-59.5236,2,0,0,2,"Falkland Islands (Islas Malvinas), United Kingdom"
182103,NaN,None,Falkland Islands (Islas Malvinas),United Kingdom,4/6/20 23:21,-51.7963,-59.5236,2,0,0,2,"Falkland Islands (Islas Malvinas), United Kingdom"

## 3. Creat Tables from staging tables

Remove unused columns in spring cases data
fips, admin2

In [25]:
%%bigquery
CREATE TABLE datamart.T1 AS
SELECT state, country, last_update,cast(latitude as numeric) as latitude,cast(longitude as numeric) as longitude,confirmed,deaths,recovered,combined_key FROM covid_19_staging.Spring_Cases;

Empty DataFrame
Columns: []
Index: []

Add combined_key to winter cases data

In [18]:
%%bigquery
CREATE TABLE datamart.T2 AS
SELECT state, country, last_update,latitude,longitude,confirmed,deaths,recovered,concat(state,',',country) as combined_key FROM covid_19_staging.Winter_Cases;

Empty DataFrame
Columns: []
Index: []

check tables before union

In [26]:
%%bigquery
select * from datamart.T1

,state,country,last_update,latitude,longitude,confirmed,deaths,recovered,combined_key
0,None,Cuba,2020-04-14 23:33:12,21.521757000,-77.781167000,766,21,132,Cuba
1,None,Cuba,2020-04-09 23:02:19,21.521757000,-77.781167000,515,15,28,Cuba
2,None,Cuba,2020-04-15 22:56:32,21.521757000,-77.781167000,814,24,151,Cuba
3,None,Cuba,2020-04-07 23:04:29,21.521757000,-77.781167000,396,11,27,Cuba
4,None,Cuba,4/6/20 23:21,21.521757000,-77.781167000,350,9,18,Cuba
...,...,...,...,...,...,...,...,...,...
182099,Channel Islands,United Kingdom,2020-04-09 23:02:19,49.372300000,-2.364400000,361,8,40,"Channel Islands, United Kingdom"
182100,Louisiana,US,3/30/20 22:52,30.125974990,-90.475350300,75,8,0,"St. John the Baptist, Louisiana, US"
182101,Louisiana,US,3/30/20 22:52,30.125974990,-90.475350300,75,8,0,"St. John the Baptist, Louisiana, US"
182102,Michigan,US,2020-04-13 23:07:54,None,None,370,8,0,"Michigan Department of Corrections (MDOC), Mic..."
182103,Michigan,US,2020-04-13 23:07:54,None,None,370,8,0,"Michigan Department of Corrections (MDOC), Mic..."

In [19]:
%%bigquery
select * from datamart.T2

,state,country,last_update,latitude,longitude,confirmed,deaths,recovered,combined_key
0,None,Malaysia,1/23/20 17:00,None,None,NaN,NaN,NaN,None
1,Anhui,Mainland China,1/23/20 17:00,None,None,9.0,NaN,NaN,"Anhui,Mainland China"
2,None,Singapore,1/23/20 17:00,None,None,1.0,NaN,NaN,None
3,Qinghai,Mainland China,1/23/20 17:00,None,None,NaN,NaN,NaN,"Qinghai,Mainland China"
4,None,Thailand,1/23/20 17:00,None,None,3.0,NaN,NaN,None
...,...,...,...,...,...,...,...,...,...
15229,None,Uganda,2020-03-21T23:43:02,1.000000000,32.000000000,1.0,0.0,0.0,None
15230,None,Cape Verde,2020-03-21T23:43:02,15.111100000,-23.616700000,1.0,0.0,0.0,None
15231,None,Cape Verde,2020-03-21T23:43:02,15.111100000,-23.616700000,1.0,0.0,0.0,None
15232,None,Papua New Guinea,2020-03-21T23:43:02,-6.315000000,143.955500000,1.0,0.0,0.0,None
15233,None,Papua New Guinea,2020-03-21T23:43:02,-6.315000000,143.955500000,1.0,0.0,0.0,None

Combine Srping and winter togther

In [27]:
%%bigquery
CREATE TABLE datamart.T3 AS
SELECT * FROM datamart.T1
UNION ALL
SELECT * FROM datamart.T2;

Empty DataFrame
Columns: []
Index: []

Create Day table by selecting combined_key, last_update

In [40]:
%%bigquery
CREATE TABLE datamart.Day AS
SELECT combined_key,cast(last_update as string) as last_update, concat(combined_key, cast(last_update as string)) as day_key from datamart.T3;

Empty DataFrame
Columns: []
Index: []

Create cases table by selcting concat(combined_key,last_update),case data

In [36]:
%%bigquery
CREATE TABLE datamart.Cases AS
SELECT combined_key, concat(combined_key, cast(last_update as string)) as day_key, confirmed, deaths, recovered from datamart.T3;

Empty DataFrame
Columns: []
Index: []

create income table

In [32]:
%%bigquery
CREATE TABLE datamart.Income AS
SELECT GEONAME, ESTIMATE, MG_ERROR FROM acs_staging.Income;

Empty DataFrame
Columns: []
Index: []

create location table

In [33]:
%%bigquery
CREATE TABLE datamart.Location AS
SELECT country, state, latitude, longitude, combined_key FROM datamart.T3 ;

Empty DataFrame
Columns: []
Index: []

## 4. For each field in tbales choose primative data type

Casting was done when creating tables before hand!

## 6. Contiue to explore data using SQL queriers

Q1 - Select state, the overall case count, deaths, and recovered patients on a given day in the US where the number of cases in the state is less than the confirmed cases in Texas.

In [78]:
%%bigquery
SELECT L.state, sum(C.confirmed) as Num_Cases,sum(C.deaths) as num_deaths,sum(C.recovered)as num_recovered
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
WHERE L.country='US'
GROUP BY L.state
HAVING Num_Cases < (SELECT sum(C.confirmed) as Num_Cases from datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key where L.state='Texas' group by L.state )
Order by Num_cases desc
limit 10;

            state  Num_Cases  num_deaths  num_recovered
0        Maryland   37135680     1034384            576
1         Indiana   36172192     1506440              0
2        Colorado   35108168     1241056              0
3            Ohio   33823464     1275920              0
4       Tennessee   26188896      470608              0
5        Virginia   24688976      539984              0
6  North Carolina   22228008      462240              0
7        Missouri   18998720      514376              0
8       Wisconsin   16867096      655208            768
9         Arizona   16132416      494608           1728

Q2 - Select the state and the maximum confrimed cases on a day in the US on countries west of Nevada based on longitude and grouped by states, having confrimed cases greater than 0

In [82]:
%%bigquery
SELECT L.state,max(C.confirmed) as num_cases
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
WHERE L.country='US' and L.longitude<(select avg(longitude) from datamart.Location where state='Nevada')
group by L.state
having num_cases >0
order by num_cases desc
limit 10
;

                    state  num_cases
0              California      13823
1              Washington       5174
2                  Nevada       2998
3                   Idaho        598
4                  Oregon        520
5                  Hawaii        385
6                  Alaska        155
7         King County, WA         83
8  Santa Clara County, CA         38
9    Snohomish County, WA         31

Q3 - Select the state, the maximum deaths on a given day in California, Texas or Washington (grouped by state)

In [64]:
%%bigquery
SELECT L.state,max(C.deaths) as greatest_deaths_on_a_day
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
WHERE L.state='California' or L.state='Texas' or L.state='Washington'
group by L.state
;

        state  greatest_deaths_on_a_day
0       Texas                        78
1  California                       619
2  Washington                       346

Q4 - Select the state and the max number of deaths on a given day where the max deaths are greater than of the max death of california

In [70]:
%%bigquery
SELECT L.state,max(C.deaths) as greatest_deaths_on_a_day
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
group by L.state
HAVING greatest_deaths_on_a_day>(SELECT max(C.deaths) FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key where L.state='California' group by L.state )
order by L.state desc
limit 5
;

        state  greatest_deaths_on_a_day
0      Quebec                       939
1     Ontario                       624
2    New York                     14604
3  New Jersey                       787
4    Michigan                      1148

Q5 Select covid stats (case,deaths, and recovered) frome hometown. For all days

In [77]:
%%bigquery
SELECT L.combined_key, sum(C.confirmed) as Num_Cases,sum(C.deaths) as num_deaths,sum(C.recovered)as num_recovered
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
where L.combined_key='Medina, Texas, US'
group by L.combined_key
;

        combined_key  Num_Cases  num_deaths  num_recovered
0  Medina, Texas, US      50640        4080              0

## 7. Create data visuals

Veiw 1:

In [80]:
%%bigquery
CREATE VIEW reports.States_greater_than_cali_deaths AS
SELECT L.state,max(C.deaths) as greatest_deaths_on_a_day
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
group by L.state
HAVING greatest_deaths_on_a_day>(SELECT max(C.deaths) FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key where L.state='California' group by L.state )
order by L.state desc
limit 5
;

Empty DataFrame
Columns: []
Index: []

veiw 2:

In [84]:
%%bigquery
CREATE VIEW reports.max_day_cases_west_coast_states AS
SELECT L.state,max(C.confirmed) as num_cases
FROM datamart.Location as L INNER JOIN datamart.Day as D on L.combined_key=D.combined_key INNER JOIN datamart.Cases as C on C.day_key=D.day_key
WHERE L.country='US' and L.longitude<(select avg(longitude) from datamart.Location where state='Nevada')
group by L.state
having num_cases >0
order by num_cases desc
limit 10
;

Empty DataFrame
Columns: []
Index: []